app/Controllers/Admin/Chatbot.php

SELECT *
FROM `chatbot`
---
    public function index()
    {
        $data = [
            'title' => 'Daftar Data Chatbot |MJ Sport Collection',
            'chatbot' => $this->chatbotModel->findAll(),