app/Controllers/Admin/Home.php

SELECT *
FROM `transaksi`
SELECT COUNT(*) AS `numrows`
FROM `pengembalian`
WHERE `validasi` = 'Valid'
SELECT *
FROM `kategori`
SELECT *
FROM `produk`
SELECT *
FROM `ongkir`
SELECT *
FROM `pengembalian`
SELECT COUNT(*) AS `numrows`
FROM `produk`
SELECT COUNT(*) AS `numrows`
FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
SELECT COUNT(*) AS `numrows`
FROM `ongkir`
SELECT YEAR(created_at) as tahun
FROM `transaksi`
GROUP BY `tahun`
---
    public function index()
    {
        // fillter

        $filter_tp = $this->request->getVar('filter_tp');
        $tanggal_tp = $this->request->getVar('tanggal_tp');
        $bulan_tp = $this->request->getVar('bulan_tp');
        $tahun_tp = $this->request->getVar('tahun_tp');


        // cek filter
        if ($filter_tp != '') {
            if ($filter_tp == 'tgl_tp') {
                $transaksi_tp = $this->transaksiModel->where('DATE(created_at)', $tanggal_tp)->get()->getResultArray();
            } else if ($filter_tp == 'bln_tp') {
                $transaksi_tp = $this->transaksiModel->where('MONTH(created_at)', date('m', strtotime($bulan_tp)), 'YEAR(created_at)', date('Y', strtotime($bulan_tp)))->get()->getResultArray();
            } else {
                $transaksi_tp = $this->transaksiModel->where('YEAR(created_at)', date('Y', strtotime($tahun_tp)))->get()->getResultArray();
            }
        } else {
            $transaksi_tp = $this->transaksiModel->findAll();
        }
        $data = [
            'title' => 'Home|MJ Sport Collection',
            'produk' => $this->produkModel->getProduk(),
            'listKategori' => $this->produkModel->get_listKategori(),
            'produks' => $this->produkModel->findAll(),
            'kategori' => $this->kategoriModel->findAll(),
            'transaksi' => $this->transaksiModel->findAll(),
            'ongkir' => $this->ongkirModel->findAll(),
            'pengembalian' => $this->pengembalianModel->findAll(),
            'countProduk' => $this->produkModel->countAllResults(),
            'countKategori' => $this->kategoriModel->countAllResults(),
            'countTransaksi' => $this->transaksiModel->countAllResults(),
            'countOngkir' => $this->ongkirModel->countAllResults(),
            'countPengembalian' => $this->pengembalianModel->where('validasi', 'Valid')->countAllResults(),
            //'countProdukByKat' => $this->produkModel->getCountProdukByKategori()->getResultArray(),
            //'kategori' => $this->kategoriModel->get()->getResultArray(),
            'transaksi_fillter' => $transaksi_tp,
            'count' => $this->transaksiModel->countAllResults(),
            'tahun' => $this->transaksiModel->select('YEAR(created_at) as tahun')->groupBy('tahun')->get()->getResultArray()
            //'periode' => $this->
        ];