app/Controllers/Admin/Home.php

    public function index()
    {
        $type = $this->request->getVar('type');
        $judulPendapatan = '';
        $judulTransaksi = '';
        $judulPengembalian = '';

        $bulan = $this->transaksiModel->select('created_at as bulan')->orderBy('created_at ASC')->groupBy('MONTH(created_at)')->get()->getResultArray();
---
SELECT `created_at` as `bulan`
FROM `transaksi`
GROUP BY MONTH(created_at)
ORDER BY `created_at` ASC