app/Controllers/Admin/Ongkir.php


        //method savenya
        $slug = url_title($this->request->getVar('kota'), '-', true);
        $this->ongkirModel->save([
            'id_ongkir' => $id,
            'kota' => $this->request->getVar('kota'),
            'slug' => $slug,
            'harga' => $this->request->getVAr('harga'),
            'gambar' => $namaGambar
        ]);
---
UPDATE `ongkir` SET `kota` = 'surabaya', `slug` = 'surabaya', `harga` = '17000', `gambar` = 'jnt.jpg', `updated_at` = '2023-03-16 10:37:27'
WHERE `ongkir`.`id_ongkir` IN ('3')