app/Controllers/Admin/Transaksi.php

    public function detail($id)
    {
        $data = [
            'title' => 'Transaksi Detail |MJ Sport Collection',
            'transaksi' => $this->transaksiModel->find($id),
            'transaksi_detail' => $this->transaksiDetailModel->where('id_transaksiFK', $id)->join('produk', 'produk.id_produk = transaksi_detail.id_produkFK')->get()->getResultArray(),
---
SELECT *
FROM `transaksi_detail`
JOIN `produk` ON `produk`.`id_produk` = `transaksi_detail`.`id_produkFK`
WHERE `id_transaksiFK` = '3'

    public function printdetail($id)
    {
        $data = [
            'title' => 'Transaksi Detail |MJ Sport Collection',
            'transaksi' => $this->transaksiModel->find($id),
            'transaksi_detail' => $this->transaksiDetailModel->where('id_transaksiFK', $id)->join('produk', 'produk.id_produk = transaksi_detail.id_produkFK')->get()->getResultArray(),
---
SELECT *
FROM `transaksi_detail`
JOIN `produk` ON `produk`.`id_produk` = `transaksi_detail`.`id_produkFK`
WHERE `id_transaksiFK` = '3'