app/Controllers/Admin/Transaksi.php

    public function index()
    {
        $data = [
            'title' => 'Daftar Transaksi |MJ Sport Collection',
            'transaksi' => $this->transaksiModel->findAll(),
            'count' => $this->transaksiModel->countAllResults(),
            'tahun' => $this->transaksiModel->select('YEAR(created_at) as tahun')->groupBy('tahun')->get()->getResultArray()
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
SELECT *
FROM `transaksi`
SELECT YEAR(created_at) as tahun
FROM `transaksi`
GROUP BY `tahun`

    public function tampilanProses()
    {
        $data = [
            'title' => 'Transaksi Sedang Di Proses |MJ Sport Collection',
            'transaksi' => $this->transaksiModel->where('validasi', 'VALID')->where('status_pengiriman', 'PROSES PENGIRIMAN')->get()->getResultArray(),
            'validation' => \Config\Services::validation(),
            'count' => $this->transaksiModel->countAllResults(),
            'tahun' => $this->transaksiModel->select('YEAR(created_at) as tahun')->groupBy('tahun')->get()->getResultArray()
---
SELECT *
FROM `transaksi`
WHERE `validasi` = 'VALID'
AND `status_pengiriman` = 'PROSES PENGIRIMAN'
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
SELECT YEAR(created_at) as tahun
FROM `transaksi`
GROUP BY `tahun`