app/Views/admin/home/index.php

SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `id_kategoriFK` = '1'
---
    <?php
    foreach ($kategori as $key => $value) {
        $db = \Config\Database::connect();
        $data_produk_kategori[] = $db->table('produk')
            ->where('id_kategoriFK', $value['id_kategori'])
            ->countAllResults();