app/Controllers/Chatbot.php

SELECT `jawaban`
FROM `chatbot`
WHERE `pertanyaan` LIKE '%coba ajasi%' ESCAPE '!'
SELECT *
FROM `chatbot`
SELECT *
FROM `chatbot`
WHERE `pertanyaan` LIKE '%coba ajasi%' ESCAPE '!'
SELECT `pertanyaan`
FROM `chatbot`
WHERE `pertanyaan` LIKE '%coba ajasi%' ESCAPE '!'
---
    public function index()
    {
        $data = [
            'title' => 'Chatbot |MJ Sport Collection',
            'chatbot' => $this->chatbotModel->findAll(),
            // 'bls' => $this->chatbotModel->select('jawaban')->like('pertanyaan', $pesan)->get()->getResultArray(),
        ];
        //request
        $request = \Config\Services::request();
        if ($request->isAJAX()) {
            // mengambil pesan ajax
            $pesan = $request->getVar('isi_pesan');
            $cek_data = $this->chatbotModel->like('pertanyaan', $pesan)->get();

            //jika pertanyaan/data ditemukan, maka tampilkan jawaban
            if ($cek_data->getNumRows() > 0) {
                //hasil query tampung kedalam variable data
                $data = $cek_data->getResultArray();