app/Models/KeranjangModel.php

    public function getKeranjang()
    {
        return $this->db->table('keranjang')
            ->join('users', 'users.id=keranjang.id_userFK')
            ->join('produk', 'produk.id_produk=keranjang.id_produkFK')
            ->get()->getResultArray();
---
SELECT *
FROM `keranjang`
JOIN `users` ON `users`.`id`=`keranjang`.`id_userFK`
JOIN `produk` ON `produk`.`id_produk`=`keranjang`.`id_produkFK`