app/Models/OngkirModel.php

    public function getOngkir($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }
        return $this->where(['slug' => $slug])->first();
---
SELECT *
FROM `ongkir`
WHERE `slug` = 'surabaya'
 LIMIT 1