app/Models/ProdukModel.php

SELECT *
FROM `produk`
---
    public function getProduk($slug_produk = false)
    {
        if ($slug_produk == false) {
            return $this->findAll();

SELECT *
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori`=`produk`.`id_kategoriFK`
WHERE `slug_produk` = 'jersey-mizuno-motif-1-merah-size-m'
---
    public function getProdukAdmin($slug_produk = false)
    {
        if ($slug_produk == false) {
            // $db      = \Config\Database::connect();
            // $builder = $db->table('produk');
            // $builder->join('admin', 'admin.id_admin=produk.id_adminFK');
            // $builder->join('kategori', 'kategori.id_kategori=produk.id_kategoriFK');
            // $query = $builder->get();
            // return $query;
            return $this->db->table('produk')
                //->join('admin', 'admin.id_admin=produk.id_adminFK')
                ->join('kategori', 'kategori.id_kategori=produk.id_kategoriFK')
                ->get()->getResultArray();
            // $query = $db->query('select id_produk, harga, stok, gambar, deskripsi, size, nama_admin from produk p left join
            // admin a on p.id_adminFK=a.id_admin, nama_kategori from produk p left join kategori k on p.id_kategoriFK=k.id_kategori');
            // $result = $query->getResultArray();
        }
        //return $this->where(['slug_produk' => $slug_produk])->first();
        return $this->db->table('produk')
            //->join('admin', 'admin.id_admin=produk.id_adminFK')
            ->join('kategori', 'kategori.id_kategori=produk.id_kategoriFK')
            ->where('slug_produk', $slug_produk)
            ->get()->getResultArray();