app/Models/TransaksiModel.php

    public function getTransaksi()
    {
        return $this->db->table('transaksi')
            ->join('keranjang', 'keranjang.id_keranjang=transaksi.id_keranjangFK')
            ->join('ongkir', 'ongkir.id_ongkir=transaksi.id_ongkirFK')
            ->get()->getResultArray();
---
SELECT *
FROM `transaksi`
JOIN `keranjang` ON `keranjang`.`id_keranjang`=`transaksi`.`id_keranjangFK`
JOIN `ongkir` ON `ongkir`.`id_ongkir`=`transaksi`.`id_ongkirFK`